import "./About.css";
import { Fragment } from "react";
import Text from "./Text/Text";
import Title from "./Title/Title";
import Badge from "./Badge/Badge";

const About = () => {
  const dataList = [
    {
      title: "درباره ی گیمیکس",
      text: `در گیمیکس تمام دوره ها از لحنی روان و ساده استفاده شده به طوری که اگر
      مخاطب سوالی در ذهنش پیش امد با دیدن ویدیو به جواب ان سوال پی ببرد. و این
      نکته از اهمیت زیادی برخوردار است چرا که قدم های بعدی یادگیری شما به درک
      مفاهیم وابسته است و ما این کار را به بهترین شکل انجام دادیم.`,
    },
    {
      title: "ویژگی های آموزش ما",
      text: (
        <>
          <Badge>زبان ساده و روان</Badge>
          <div>
            امروزه پیدا کردن یک دوره آموزشی برنامه نویسی اونم در حوزه ی بازی
            سازی کار بسیار سختی است که هرچند که اگر وجود داشته باشند به کوچکترین
            استاندارد های یک دوره ی آموزشی مناسب دقت نکردند. اما ما در گیمیکس
            اینجاییم که با رعایت تمامی استاندارد ها و اراعه ی دوره هایی با کیفیت
            شما را از صفر به یک برنامه نویس حرفه ای تبدیل کنیم. این دوره ها حاصل
            سال ها تجربه کار برنامه نویسی آن است که به صورت یکجا درآمده تا در
            دسترس شما دوستان گرامی باشد.
          </div>
        </>
      ),
    },
    {
      text: (
        <>
          <Badge>از صفر تا صد</Badge>
          <div>
            ما سعی کردیم تا مباحث را از صفر حتی برای کسی که هیچ آشنایی با برنامه
            نویسی ندارند تا پیشرفته پوشش دهیم تا فقط با شرکت در یک دوره به سطحی
            مناسب برای ورود به بازار کار برسید.
          </div>
        </>
      ),
    },
    {
      text: (
        <>
          <Badge>پروژه محور</Badge>
          <div>
            هیچ چیز به غیر از یک پروژه ی واقعی نمی تواند مفاهیم سخت و طولانی
            برنامه نویسی را برساند پس ما در تمام دوره های گیمیکس تعداد زیادی
            پروژه و تمرین های پیشرفته جل کردیم تا دید بالایی از برنامه به شما
            داده شود.
          </div>
        </>
      ),
    },
    {
      text: (
        <>
          <Badge>آپدیت</Badge>
          <div>
            برنامه نویسی همیشه علمی در حال حرکت به سمت جلو و پیشرفت بوده
            بنابراین ما سعی کردیم تا این دوره ها را آپدیت نگه داریم به صورتی که
            اخرین ورژن از هر تکنولوژی در داخل دوره ها پوشش داده شود.
          </div>
        </>
      ),
    },
    {
      title: "ایا دوره ها تضمین استخدام دارند؟",
      text: `رسیدن به مرحله استخدام دو فاکتور بسیار مهم دارد 1-دوره آموزشی و 2-تلاش
      شما. پس داشتن دوره ای خوب تنها فاکتور استخدام شدن شما نیس بلکه بیشتر کار
      بستگی به تلاش شما و وقت صرف شده ی شما دارد. بنابراین اگر تلاش کافی را
      داشته باشید قول میدهیم که به زودی به مرحله ی استخدام خواهید رسید.`,
    },
  ];

  return (
    <div className="About-Us Container">
      {dataList.map((item, index) => (
        <Fragment key={index}>
          <Title>{item.title}</Title>
          <Text>{item.text}</Text>
        </Fragment>
      ))}
    </div>
  );
};

export default About;
